app/controllers/articulos_controller.rb

SELECT * FROM `tipo_articulos`
---
  def index
    @articulos = Articulo.all

SELECT * FROM `tipo_articulos` WHERE (`tipo_articulos`.`id` = 1)
---
  def show
    @articulo = Articulo.find(params[:id])

SELECT * FROM `articulos` WHERE (`articulos`.`id` = 1)
---
  def edit
    @tipo_articulos = TipoArticulo.find(:all)

INSERT INTO `articulos` (`tipo_articulo_id`, `created_at`, `screenshot_file_name`, `descrip_alternativo`, `screenshot_file_size`, `updated_at`, `unid_medida_id`, `color_id`, `descripcion`, `codigo`, `screenshot_content_type`, `familia_id`, `linea_id`, `grupo_id`, `codigo_alterno`, `estado`, `afecta_stock`, `screenshot_updated_at`, `marca`, `coment`) VALUES(NULL, '2010-04-07 06:30:04', 'batman_background_by_jlfarfan.jpg', '', 117378, '2010-04-07 06:30:04', NULL, NULL, '', '', 'image/jpeg', NULL, NULL, NULL, '', 0, 0, '2010-04-07 06:30:04', '', '')
---
  def create
    @articulo = Articulo.new(params[:articulo])

    respond_to do |format|
      if @articulo.save

SELECT * FROM `articulos` WHERE (`articulos`.`id` = 1)
UPDATE `articulos` SET `updated_at` = '2010-04-05 02:19:35', `unid_medida_id` = 3 WHERE `id` = 1
---
  def update
    @articulo = Articulo.find(params[:id])

    respond_to do |format|
      if @articulo.update_attributes(params[:articulo])

SELECT * FROM `articulos` WHERE (`articulos`.`id` = 1)
DELETE FROM `articulos` WHERE `id` = 1
---
  def destroy
    @articulo = Articulo.find(params[:id])
    @articulo.destroy