app/controllers/tipo_articulos_controller.rb

  def index
    @tipo_articulos = TipoArticulo.all
---
SELECT * FROM `tipo_articulos`

  def show
    @tipo_articulo = TipoArticulo.find(params[:id])
---
SELECT * FROM `tipo_articulos` WHERE (`tipo_articulos`.`id` = 1)

  def create
    @tipo_articulo = TipoArticulo.new(params[:tipo_articulo])

    respond_to do |format|
      if @tipo_articulo.save
---
INSERT INTO `tipo_articulos` (`created_at`, `updated_at`, `descripcion`, `codigo`) VALUES('2010-04-01 23:47:12', '2010-04-01 23:47:12', 'madera', '01')