app/controllers/transportistas_controller.rb

SELECT * FROM `transportistas`
---
  def index
    @transportistas = Transportista.all