app/controllers/unid_medidas_controller.rb

SELECT * FROM `unid_medidas`
---
  def index
    @unid_medidas = UnidMedida.all

SELECT * FROM `unid_medidas` WHERE (`unid_medidas`.`id` = 1)
---
  def show
    @unid_medida = UnidMedida.find(params[:id])

SELECT * FROM `unid_medidas` WHERE (`unid_medidas`.`id` = 1)
---
  def edit
    @unid_medida = UnidMedida.find(params[:id])

INSERT INTO `unid_medidas` (`created_at`, `updated_at`, `descripcion`, `codigo`) VALUES('2010-04-04 18:36:02', '2010-04-04 18:36:02', 'cm', '01')
---
  def create
    @unid_medida = UnidMedida.new(params[:unid_medida])

    respond_to do |format|
      if @unid_medida.save

SELECT * FROM `unid_medidas` WHERE (`unid_medidas`.`id` = 1)
UPDATE `unid_medidas` SET `updated_at` = '2010-04-04 18:36:46', `descripcion` = 'centimetros' WHERE `id` = 1
---
  def update
    @unid_medida = UnidMedida.find(params[:id])

    respond_to do |format|
      if @unid_medida.update_attributes(params[:unid_medida])